import { Component } from '@angular/core';
import {NgStyle, TitleCasePipe, UpperCasePipe} from "@angular/common";

@Component({
  selector: 'app-about',
  standalone: true,
  imports: [
    UpperCasePipe,
    NgStyle,
    TitleCasePipe
  ],
  templateUrl: './about.component.html',
  styleUrl: './about.component.css'
})
export class AboutComponent {
  points = [
    "Ласкаво просимо на Студентський Портал - ваш найкращий ресурс для всіх новин, що стосуються студентського життя! Тут ви знайдете найактуальніші новини з університетів та коледжів, інформацію про заходи, студентські ініціативи та події. Наш портал допоможе вам бути в курсі всіх важливих подій, що відбуваються в студентському світі. Ми висвітлюємо різноманітні теми, включаючи академічні досягнення, спортивні змагання, культурні заходи та соціальні ініціативи. Наші статті написані студентами для студентів, що дозволяє нам надавати інформацію з першоджерела і з урахуванням ваших інтересів та потреб. Приєднуйтесь до нашої спільноти, щоб отримувати ексклюзивні інтерв'ю з викладачами та студентськими лідерами, огляди найновіших студентських проектів і стартапів, а також корисні поради щодо навчання, кар'єри та саморозвитку. Студентський Портал - це ваш голос у студентському середовищі. Будьте з нами, щоб завжди бути на крок попереду!",
    
  ];
}
