import {Injectable} from '@angular/core';
import {HttpClient} from "@angular/common/http";
import {catchError, Observable, of} from "rxjs";
import {News} from "../MODELS/models";

@Injectable({
  providedIn: 'root'
})
export class BackendService {

  constructor(private http: HttpClient) {
  }

  getNews(): Observable<News[]> {
    return this.http.get<News[]>('http://localhost:3000/news').pipe(catchError(err => {
      return of(news)
    }))
  }
}

const news: News[] = [
  {
    id: 1,
    title: "Scimago Institutions Rankings 2024",
    description: "За результатами міжнародного рейтингу університетів The SCImago Institutions Rankings 2024 Національний університет «Полтавська політехніка імені Юрія Кондратюка» посів 46-ту рейтингову позицію серед українських закладів вищої освіти",
    imgUrl: "https://nupp.edu.ua/uploads/files/0/news/2024/06/18/0.jpg",
    newsText: "За результатами міжнародного рейтингу університетів The SCImago Institutions Rankings 2024 Національний університет «Полтавська політехніка імені Юрія Кондратюка» посів 46-ту рейтингову позицію серед українських закладів вищої освіти",
    author: "Політехніка",
  },
  {
    id: 2,
    title: "П’ятьох представників Полтавської політехніки відзначили за вагомий внесок у розвиток національно-патріотичного виховання сучасної молоді",
    description: "Ректор Національного університету «Полтавська політехніка імені Юрія Кондратюка», професор Володимир Онищенко нагородив Грамотами Полтавського обласного центру національно-патріотичного виховання, туризму і краєзнавства учнівської молоді п’ятьох науковців і співробітників університету за активну участь у проведенні Всеукраїнської дитячо-юнацької військово-патріотичної гри Сокіл («Джура»)..",
    imgUrl: "https://nupp.edu.ua/uploads/files/0/news/2024/06/17/development%20of%20national%20and%20patriotic%20education/0.jpg",
    newsText: "Ректор Національного університету «Полтавська політехніка імені Юрія Кондратюка», професор Володимир Онищенко нагородив Грамотами Полтавського обласного центру національно-патріотичного виховання, туризму і краєзнавства учнівської молоді п’ятьох науковців і співробітників університету за активну участь у проведенні Всеукраїнської дитячо-юнацької військово-патріотичної гри Сокіл («Джура»).",
    author: "Політехніка",
  },
  {
    id: 3,
    title: "Музей",
    description: "За період роботи Музей науки вже прийняв понад 7000 відвідувачів, ставши найпопулярнішою локацією Полтави",
    imgUrl: "https://nupp.edu.ua/uploads/files/0/news/2024/06/15/Museum%20of%20Science/0.jpeg",
    newsText: "За період роботи Музей науки вже прийняв понад 7000 відвідувачів, ставши найпопулярнішою локацією Полтави",
    author: "Політехніка",
  },
  
];
